Repository: 4erunner/cs_cart_api_merlion
Catalog: var/langs/*/addons/api_merlion.po
Languages: ru_ru

# Addons::name::api_merlion
source: API Merlion
ru_ru: API Мерлион

# Addons::description::api_merlion
source: Working with the Merlion goods through the Web-service (API) B2B-module
ru_ru: Работа с товарами Merlion через Web-сервис (API) B2B-модуля

# Languages::api_merlion_menu
source: API Merlion
ru_ru: API Мерлион

# Languages::api_merlion_menu_orders
source: API Merlion
ru_ru: API Мерлион

# Languages::api_merlion_menu_menu_description
source: Managing groups and importing products
ru_ru: Управление группами и импортирование товаров

# Languages::api_merlion_menu_orders_menu_description
source: Information about the ordering system in the API Merlion
ru_ru: Информация о заказав в системе API Мерлиона

# Languages::api_merlion_import_items
source: Items
ru_ru: Товары

# Languages::api_merlion_import_features
source: Features
ru_ru: Характеристики

# Languages::api_merlion_import_images
source: Images
ru_ru: Изображения

# Languages::api_merlion_additional_fields
source: Additional fields
ru_ru: Дополнительные поля

# Languages::api_merlion_for_downloaded
source: Only active products
ru_ru: Только активные товары

# Languages::api_merlion_all_categories
source: All categories
ru_ru: Все по категориям

# Languages::api_merlion_settings.manage_handbooks
source: API Merlion: Setup default Handbooks
ru_ru: API Мерлион: Настройки Справочников поумолчанию.

# Languages::api_merlion_settings.manage_values
source: API Merlion: Setup Values
ru_ru: API Мерлион: Настройки Переменных

# Languages::api_merlion_settings.update_catalog_groups
source: API Merlion: Update Catalog
ru_ru: API Мерлион: Обновить Каталог

# Languages::api_merlion_settings.update_shipment_date
source: API Merlion: Update shipment date
ru_ru: API Мерлион: Обновить дату отгрузки

# Languages::api_merlion_settings.handbook
source: Handbook
ru_ru: Справочник

# Languages::api_merlion_settings.values
source: Values
ru_ru: Значения

# Languages::api_merlion_settings.counter
source: Accounts
ru_ru: Контрагенты

# Languages::api_merlion_settings.shipment_agent
source: Shipping agent
ru_ru: Агенты по доставке

# Languages::api_merlion_settings.shipment_date
source: Available shipping date
ru_ru: Доступные даты отгрузки

# Languages::api_merlion_settings.shipment_method
source: Available methods of shipment
ru_ru: Доступные методы отгрузки

# Languages::api_merlion_settings.order_id
source: Number current order
ru_ru: Номер актуального заказ

# Languages::api_merlion_settings.order_auto_create
source: Automatic creation of order
ru_ru: Автоматическое создание заказа

# Languages::api_merlion_settings.order_note
source: Creator identifier
ru_ru: Идентификатор создателя

# Languages::api_merlion_settings.create_order
source: Create order
ru_ru: Создать заказ

# Languages::api_merlion_settings.yml_export
source: Аctivation code (YML_export)
ru_ru: Код активации (YML_export)

# Languages::api_merlion_settings.yml_export_enable
source: Use (YML_export)
ru_ru: Использовать (YML_export)

# Languages::api_merlion_settings.updated_shipment_date
source: Shipment date is updated to
ru_ru: Дата отгрузки обновлена до

# Languages::api_merlion_settings.product_available
source: The selection mode of prices and quantities of goods.
ru_ru: Режим выбора цен и количества товаров.

# Languages::api_merlion_settings.product_package
source: Selling goods packages?
ru_ru: Продавать товар упаковками?

# Languages::api_merlion_settings.products_filters_create
source: Create product filters?
ru_ru: Создавать фильтры товаров?

# Languages::api_merlion_settings.products_filters_bind
source: Bind filters to categories?
ru_ru: Привязать фильтры к категориям?

# Languages::api_merlion_settings.products_filters_enable
source: Enable filters when creating?
ru_ru: Включать фильтры при создании?

# Languages::api_merlion_settings.products_filters_delete
source: Remove filters?
ru_ru: Удалить фильтры?

# Languages::api_merlion_settings.sort_features
source: Sort features on the product page?
ru_ru: Сортировать характеристики на странице товара?

# Languages::api_merlion_settings.representative
source: The representative of the host contract
ru_ru: Представитель по основному договору

# Languages::api_merlion_settings.endpoint_delivery_id
source: The final delivery point
ru_ru: Конечная точека доставки

# Languages::api_merlion_settings.packing_type
source: Type of packaging
ru_ru: Тип упаковки

# Languages::api_merlion_settings.delete_order
source: Delete order
ru_ru: Удалить заказ

# Languages::api_merlion_products.attach_groups
source: API Merlion: Attach groups to categories.
ru_ru: API Мерлион: Прикрепить группы к категориям.

# Languages::api_merlion_products.managing_groups
source: API Merlion: Managing groups.
ru_ru: API Мерлион: Управление группами.

# Languages::api_merlion_products.groups
source: Merlion groups
ru_ru: Мерлион группы

# Languages::api_merlion_products.attach_title_clear
source: Detach group
ru_ru: Отсоединить группу

# Languages::api_merlion_products.attach_title_attach
source: Attach group
ru_ru: Присоединить группу

# Languages::api_merlion_products.import
source: API Merlion: Import products
ru_ru: API Мерлион: Импортировать товары

# Languages::api_merlion_products.import_button
source: Import
ru_ru: Импортировать

# Languages::api_merlion_products.delete_file
source: Delete the import file?
ru_ru: Удалять файл импорта?

# Languages::api_merlion_products.import_offline
source: Stand-alone operation
ru_ru: Автономная работа

# Languages::api_merlion_products.about_update_values
source: Variable signaling the operation of the module.
ru_ru: Переменные сигнализирующие о работе модуля.

# Languages::api_merlion_products.about_operation_values
source: The variables involved in the operation of the module.
ru_ru: Переменные участвующие в работе модуля.

# Languages::api_merlion_products.items_update
source: Updating products
ru_ru: Обновление продукции

# Languages::api_merlion_products.items_quantity
source: Update product prices
ru_ru: Обновлять цены товаров

# Languages::api_merlion_products.images_force
source: Force update
ru_ru: Принудительно обновить

# Languages::api_merlion_products.features_update
source: Update features
ru_ru: Обновление характеристик

# Languages::api_merlion_products.images_update
source: Update images
ru_ru: Обновление изображений

# Languages::api_merlion_products.process_update
source: If the switch is on, the update is running.
ru_ru: Если переключатель включен, обновление запущено.

# Languages::api_merlion_products.get_current_data_product
source: Get current data product
ru_ru: Получить актуальные данные товара

# Languages::api_merlion_products.get_status_product
source: Get current status product
ru_ru: Получить актуальные статус товара

# Languages::api_merlion_products.set_order_product
source: Add to order
ru_ru: Поставить в заказ

# Languages::api_merlion_products.product_from_order
source: This product from the order number
ru_ru: Товар из заказа №

# Languages::api_merlion_products.will_be_placed
source: will be placed in the system API Merlion.
ru_ru: будет размещен в системе API Мерлион.

# Languages::api_merlion_products.no_products_amount
source: No amount of available product
ru_ru: Нет доступного количества товара

# Languages::api_merlion_products.partnumber_name
source: Part number in the product name
ru_ru: Партномер в названии продукта

# Languages::api_merlion_orders.order_found
source: Order No. [order] found
ru_ru: Заказ номер [order] найден

# Languages::api_merlion_orders.order_created
source: Order No. [order] is created
ru_ru: Заказ номер [order] создан

# Languages::api_merlion_orders.add_to_order
source: Product product_code in the amount _amount_ added to reserves api_merlion_order
ru_ru: Товар product_code в количестве amount добавлен в резерв api_merlion_order

# Languages::api_merlion_orders.del_to_order
source: Product product_code in the amount _amount_ delete from api_merlion_order
ru_ru: Товар product_code в количестве amount удален из резерва api_merlion_order

# Languages::api_merlion_orders.already_to_order
source: Already added to the reserve
ru_ru: Уже добавлен в резерв

# Languages::api_merlion_orders.need_order
source: Need order for reservation
ru_ru: Необходим заказ для резервирования

# Languages::api_merlion_orders.status
source: Status
ru_ru: Статус

# Languages::api_merlion_orders.action
source: Action
ru_ru: Действие

# Languages::api_merlion_orders.supplier_price_higher
source: The supplier price is higher than in the order!
ru_ru: Цена поставщика выше чем в заказе!

# Languages::api_merlion_orders.supplier_product_less
source: Products at the supplier is less than in the order!
ru_ru: Товаров у поставщика меньше чем в заказе!

# Languages::api_merlion_orders.product_status_expired
source: Status product expired!
ru_ru: Статус товара устарел!

# Languages::api_merlion_orders.product_status_wrong
source: Status product wrong!
ru_ru: Не правильный статус товара!

# Languages::api_merlion_orders.product_in_reserve
source: In reserve
ru_ru: В резерве

# Languages::api_merlion_orders.manage
source: API Merlion: order management
ru_ru: API Мерлион: управление заказами

# Languages::api_merlion_orders.description
source: Description
ru_ru: Описание

# Languages::api_merlion_orders.doc_no
source: Document number
ru_ru: Номер документа

# Languages::api_merlion_orders.total_cost
source: Total cost
ru_ru: Общая стоимость

# Languages::api_merlion_orders.quantity
source: Quantity
ru_ru: Количество

# Languages::api_merlion_orders.reserve_date
source: reserve Date
ru_ru: Дата резерва

# Languages::api_merlion_orders.order_date
source: order Date
ru_ru: Дата заказа

# Languages::api_merlion_errors.error_authorization
source: Do not fill in the data for authorization.
ru_ru: Не заполнены данные для авторизации.

# Languages::api_merlion_errors.error_connection
source: Connection error, check the logs.
ru_ru: Ошибка соединения, просмотрите логи.

# Languages::api_merlion_errors.wrong_type_data
source: Wrong type data, check the logs.
ru_ru: Неправильно тип данных, просмотрите логи.

# Languages::api_merlion_errors.no_data
source: No data.
ru_ru: Нет данных.

# Languages::api_merlion_errors.no_products_update
source: No products for update or goods is not characteristic of the Language!
ru_ru: Нет товаров для обновления или у товаров отсутствует характеристика Language!

# Languages::api_merlion_errors.no_period
source: Not specified period
ru_ru: Не задан пероид

# Languages::api_merlion_errors.order_update_wrong_type
source: TYPE update wrong! Must be "ADD" or "DEL"
ru_ru: не верный ТИП обновения! Должен быть "ADD" или "DEL"

# Languages::api_merlion_errors.order_no_product
source: Your order has no such product
ru_ru: В вашем заказе нет такого товара

# Languages::api_merlion_notice.warning
source: Working
ru_ru: Работает

# Languages::api_merlion_notice.groups_update
source: Groups have been updated. Updated:
ru_ru: Группы обновлены. Обновлено:

# Languages::api_merlion_notice.groups_deleted
source: Removing unused:
ru_ru: Удалено не используемых:

# Languages::api_merlion_notice.groups_disable
source: Disabled groups:
ru_ru: Отключено групп:

# Languages::api_merlion_notice.process_update
source: Disables the update, if the update was not running!
ru_ru: Блокирует обноеление, если обновление не было запущено!

# Languages::api_merlion_notice.process_update_running
source: Update is already running!
ru_ru: Обновление уже запущено!

# Languages::api_merlion_tooltip.feature_comparison
source: select the value of the field [Feature comparison] in the import of products
ru_ru: выбрать значение поля "Feature comparison" в импорте продуктов

# Languages::api_merlion_tooltip.list_price
source: Where to use the recommended price from the price list Merlion
ru_ru: Где использовать рекомендованную цену из прайс-листа Мерлион

# Languages::api_merlion_tooltip.yml_export
source: If you specify a Аctivation code (YML_export), after the completion of the import goods, export of data to be launched in the YML.
ru_ru: Если указан Код активации (YML_export), после завершения импорта продукции, будет запущен экспорт данных в YML.

# Languages::api_merlion_tooltip.product_available
source: Off - all active products, Enabled - available only for reserving products.
ru_ru: Выключен – все активные товары , Включен – только доступные для резервирования товары.

# Languages::api_merlion_tooltip.delete_file
source: Removal of import files after the completion of all operations. If disabled - files will be stored on the server, they are unique and will take up space on the disk!
ru_ru: Удаление файлов импорта после завершения всех операций. Если отключено - файлы будут сохраняться на сервере, они уникальны и будут занимать место на диске!

# Languages::api_merlion_tooltip.import_offline
source: Do not use API Merlion for data acquisition, local tables are used.
ru_ru: Не использует API Мерлион для получения данных, используются локальные таблицы.

# Languages::api_merlion_tooltip.logging
source: logging will be carried out in a folder:
ru_ru: логирование будет осуществлятся в папку:

# Languages::api_merlion_tooltip.cron_hint
source: Running via cron
ru_ru: Запуск через cron

# Languages::api_merlion_tooltip.products_filters_create
source: Creates filters having features. Sets the filters to categories.
ru_ru: Создает фильтры по имеющимся характеристикам.

# Languages::api_merlion_tooltip.products_filters_bind
source: Bind categories filters to update features.
ru_ru: Привязывает фильтры к категориям при обновлении характеристик.

# Languages::api_merlion_tooltip.products_filters_enable
source: If the option is checked the filter will be created on, otherwise off.
ru_ru: Если параметр активирован фильтр будет создан включеным, иначе выключеным.

# Languages::api_merlion_tooltip.products_filters_delete
source: Removes filters are disabled!
ru_ru: Удаляет отключенные фильтры!

# Languages::api_merlion_tooltip.products_choose_category
source: *Optional parameter* Select the category or category for the update. Categories will be processed if they are added to the list or the current selected category will be processed.
ru_ru: *Hеобязательный параметр* Выберете категории или категорию для обновления. Категории будет обработаны если они даобавлены в список либо тока выбранная каатегория будет обработана.

# Languages::api_merlion_tooltip.order_auto_create
source: In the absence of an order to create a new one. You must fill in a note to the order, to order the search!
ru_ru: При отсутствии заказа создавать новый. Необходимо заполнить примечание к заказу, для поиска заказа!

# Languages::api_merlion_tooltip.order_note
source: It is necessary to order the search!
ru_ru: Необходимо для поиска заказа!

# Languages::api_merlion_tooltip.partnumber_name
source: Adds the part number in the product name.
ru_ru: Добавляет партномер в название продукта.

# Languages::api_merlion_tooltip.order_get_status_products
source: Get the current status products.
ru_ru: Получить актуальные статусы товаров.

# Languages::api_merlion_tooltip.order_reserve_all_products
source: Put to reserve all available products.
ru_ru: Поставить в резерв все доступные товары.

# Languages::api_merlion_tooltip.order_status_no
source: This product is not in stock, you can not put it in reserve.
ru_ru: Данного товара нет на складах, нет возможности поставить его в резерв.

# Languages::api_merlion_tooltip.order_status_ok
source: This product is available for reservation.
ru_ru: Товар доступен для резервирования.

# Languages::api_merlion_tooltip.order_status_warning
source: This product has restrictions on removal from the reserve! Removal from the reserve - pay!
ru_ru: Данный товар имеет ограничения по снятию с резерва! Снятие с резерва - платное!

# Languages::api_merlion_tooltip.order_product_reserved
source: This product is reserved.
ru_ru: Товар зарезервирован.

# Languages::api_merlion_tooltip.order_reserve_product
source: Put product in the reserve.
ru_ru: Поставить товар в резерв.

# Languages::api_merlion_tooltip.order_unreserve_product
source: Remove the product from the reserve.
ru_ru: Снять товар с резерва.

# Languages::privileges.manage_api_merlion
source: Manage API Merlion
ru_ru: Управление API Мерлион

# Languages::privileges.manage_api_merlion_product
source: Manage API Merlion (add to order, get status)
ru_ru: Управление API Мерлион (поставить в заказ, получить статус)

# Languages::api_merlion_info.no
source: Product code
ru_ru: Код товара

# Languages::api_merlion_info.name
source: Name of product
ru_ru: Наименование товара

# Languages::api_merlion_info.Brand
source: Brand name
ru_ru: Бренд

# Languages::api_merlion_info.Vendor_part
source: Part number
ru_ru: Партномер

# Languages::api_merlion_info.Size
source: The size
ru_ru: Размер

# Languages::api_merlion_info.EOL
source: Tag goods are not manufactured anymore
ru_ru: Признак товара, снятого с производства

# Languages::api_merlion_info.Warranty
source: Warranty period (months)
ru_ru: Срок гарантии (в месяцах)

# Languages::api_merlion_info.Weight
source: Weight (kg)
ru_ru: Вес (кг)

# Languages::api_merlion_info.volume
source: Volume (m3)
ru_ru: Объем (м3)

# Languages::api_merlion_info.Min_Packaged
source: Minimum order quantity
ru_ru: Минимальное количество заказа

# Languages::api_merlion_info.GroupName1
source: Name of commodity directions
ru_ru: Наименование товарного направления

# Languages::api_merlion_info.GroupName2
source: Name of commodity group
ru_ru: Наименование товарной группы

# Languages::api_merlion_info.GroupName3
source: Name of commodity subgroups
ru_ru: Наименование товарной подгруппы

# Languages::api_merlion_info.GroupCode1
source: Code commodity directions
ru_ru: Код товарного направления

# Languages::api_merlion_info.GroupCode2
source: Code of commodity group
ru_ru: Код товарной группы

# Languages::api_merlion_info.GroupCode3
source: Code of commodity subgroups
ru_ru: Код товарной подгруппы

# Languages::api_merlion_info.IsBundle
source: Tag bundle (whether goods set)
ru_ru: Признак бандла (является ли товар комплектом)

# Languages::api_merlion_info.ActionDesc
source: Name marketing action
ru_ru: Наименование маркетинговой акции

# Languages::api_merlion_info.ActionWWW
source: Link to a detailed description of the action
ru_ru: Ссылка на подробное описание акции

# Languages::api_merlion_info.Last_time_modified
source: Date, time of last modification of the goods
ru_ru: Дата-время последнего изменения товара

# Languages::api_merlion_info.PriceClient
source: Customer Price (USD)
ru_ru: Цена клиента (USD)

# Languages::api_merlion_info.PriceClient_RG
source: Customer price for the region (USD)
ru_ru: Цена клиента для региона (USD)

# Languages::api_merlion_info.PriceClient_MSK
source: Customer price for the Moscow region (USD)
ru_ru: Цена клиента для московского региона (USD)

# Languages::api_merlion_info.AvailableClient
source: Available quantity of goods
ru_ru: Доступное количество товара

# Languages::api_merlion_info.AvailableClient_RG
source: Available quantity of the goods on the regional stock
ru_ru: Доступное количество товара на региональном складе

# Languages::api_merlion_info.AvailableClient_MSK
source: Available quantity of the goods on the Moscow stock
ru_ru: Доступное количество товара на московском складе

# Languages::api_merlion_info.AvailableExpected
source: The expected arrival of goods
ru_ru: Ожидаемый приход товара

# Languages::api_merlion_info.AvailableExpectedNext
source: The next arrival of goods
ru_ru: Следующий приход товара

# Languages::api_merlion_info.DateExpectedNext
source: Date of the next arrival of goods
ru_ru: Дата следующего прихода товара

# Languages::api_merlion_info.RRP
source: The recommended retail price (RUB)
ru_ru: Рекомендованная рознич-ная цена (RUB)

# Languages::api_merlion_info.RRP_Date
source: Start Date (RRC)
ru_ru: Дата начала действия (РРЦ)

# Languages::api_merlion_info.PriceClientRUB
source: Customer Price (RUB)
ru_ru: Цена клиента (RUB)

# Languages::api_merlion_info.PriceClientRUB_RG
source: Customer price for the region (RUB)
ru_ru: Цена клиента для региона (RUB)

# Languages::api_merlion_info.PriceClientRUB_MSK
source: Customer price for the Moscow region (RUB)
ru_ru: Цена клиента для московского региона (RUB)

# Languages::api_merlion_info.Online_Reserve
source: Tag 'online reservation' (0 - yes (allowed), 1 - no (disabled), 2 - paid cancellation reserve 3 - deficit)
ru_ru: Признак 'он-лайн резервирования' (0 – да (разрешено), 1 – нет (запрещено), 2 – платная отмена резерва, 3 – дефицит)

# Languages::api_merlion_info.ReserveCost
source: Cost of cancellation of the provision ($ / unit * hour)
ru_ru: Cтоимость отмены резерва ($/шт*час)

# Languages::api_merlion_info.VAT
source: VAT rate(%)
ru_ru: Ставка НДС(%)

# Languages::api_merlion_info.Sales_Limit_Type
source: Type the minimum limit quantity
ru_ru: тип ограничения минимального количества

# Languages::api_merlion_info.s_AvailableClient
source: Product is available
ru_ru: Товар доступен

# Languages::api_merlion_info.s_Online_Reserve
source: Possible to put in reserve
ru_ru: Возможно поставить в резерв

# Languages::api_merlion_info.s_Online_Reserve_pay
source: Attention! Removal from the reserve with pay!
ru_ru: Внимание! Снятие с резерва с оплатой!

# Languages::api_merlion_info.s_DateExpectedNext
source: Date of the next arrival of goods
ru_ru: Дата следующего прихода товара

# SettingsSections::api_merlion::api_merlion_config
source: General settings
ru_ru: Общие настройки

# SettingsOptions::api_merlion::api_merlion_user
source: Login
ru_ru: Пользователь

# SettingsOptions::api_merlion::api_merlion_password
source: Password
ru_ru: Пароль

# SettingsOptions::api_merlion::api_merlion_version
source: API version
ru_ru: Версия API

# SettingsTooltips::api_merlion::api_merlion_version
source: Select version of API. Read documentation Merlion.
ru_ru: Выбор версии API по которой будет работать аддон. Отличия уточнять в документации Merlion

# SettingsOptions::api_merlion::api_merlion_import_cron_password
source: password for cron
ru_ru: пароль для cron
